experiments/throughput_for_writes/logs/20181112161839/ratio1:0_run1_vclients4_workerthreads32_client3_instance2.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  70 secs]  0 threads:       62793 ops,     851 (avg:     896) ops/sec, 3.36MB/sec (avg: 3.54MB/sec),  4.66 (avg:  4.45) msec latency

1         Threads
4         Connections per thread
70        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec 
------------------------------------------------------------------------
Sets         896.97          ---          ---      4.45400      3620.20 
Gets           0.00         0.00         0.00      0.00000         0.00 
Waits          0.00          ---          ---      0.00000          --- 
Totals       896.97         0.00         0.00      4.45400      3620.20 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.740         0.00
SET       0.760         0.00
SET       0.770         0.01
SET       0.780         0.01
SET       0.790         0.02
SET       0.800         0.03
SET       0.810         0.04
SET       0.820         0.07
SET       0.830         0.08
SET       0.840         0.11
SET       0.850         0.14
SET       0.860         0.19
SET       0.870         0.22
SET       0.880         0.30
SET       0.890         0.35
SET       0.900         0.45
SET       0.910         0.55
SET       0.920         0.66
SET       0.930         0.78
SET       0.940         0.92
SET       0.950         1.05
SET       0.960         1.23
SET       0.970         1.42
SET       0.980         1.65
SET       0.990         1.85
SET       1.000         3.44
SET       1.100         7.55
SET       1.200        13.04
SET       1.300        18.84
SET       1.400        24.18
SET       1.500        28.93
SET       1.600        32.70
SET       1.700        35.77
SET       1.800        38.17
SET       1.900        40.12
SET       2.000        41.70
SET       2.100        43.02
SET       2.200        44.14
SET       2.300        45.08
SET       2.400        45.83
SET       2.500        46.51
SET       2.600        47.15
SET       2.700        47.67
SET       2.800        48.09
SET       2.900        48.49
SET       3.000        48.87
SET       3.100        49.23
SET       3.200        49.52
SET       3.300        49.83
SET       3.400        50.17
SET       3.500        50.48
SET       3.600        50.77
SET       3.700        51.02
SET       3.800        51.26
SET       3.900        51.48
SET       4.000        51.67
SET       4.100        51.92
SET       4.200        52.16
SET       4.300        52.38
SET       4.400        52.63
SET       4.500        52.85
SET       4.600        53.11
SET       4.700        53.38
SET       4.800        53.69
SET       4.900        54.02
SET       5.000        54.35
SET       5.100        54.75
SET       5.200        55.15
SET       5.300        55.55
SET       5.400        56.00
SET       5.500        56.51
SET       5.600        57.09
SET       5.700        57.70
SET       5.800        58.37
SET       5.900        59.18
SET       6.000        60.04
SET       6.100        61.04
SET       6.200        62.11
SET       6.300        63.16
SET       6.400        64.41
SET       6.500        65.76
SET       6.600        67.24
SET       6.700        68.86
SET       6.800        70.48
SET       6.900        72.16
SET       7.000        73.89
SET       7.100        75.51
SET       7.200        77.22
SET       7.300        79.01
SET       7.400        80.73
SET       7.500        82.36
SET       7.600        83.81
SET       7.700        85.25
SET       7.800        86.62
SET       7.900        87.83
SET       8.000        88.97
SET       8.100        90.01
SET       8.200        90.86
SET       8.300        91.67
SET       8.400        92.49
SET       8.500        93.09
SET       8.600        93.63
SET       8.700        94.16
SET       8.800        94.60
SET       8.900        94.94
SET       9.000        95.25
SET       9.100        95.49
SET       9.200        95.75
SET       9.300        96.00
SET       9.400        96.17
SET       9.500        96.34
SET       9.600        96.53
SET       9.700        96.66
SET       9.800        96.79
SET       9.900        96.94
SET      10.000        97.46
SET      11.000        98.07
SET      12.000        98.42
SET      13.000        98.78
SET      14.000        99.12
SET      15.000        99.54
SET      16.000        99.73
SET      17.000        99.83
SET      18.000        99.88
SET      19.000        99.90
SET      20.000        99.92
SET      21.000        99.94
SET      22.000        99.96
SET      24.000        99.98
SET      25.000        99.98
SET      26.000        99.98
SET      27.000        99.99
SET      28.000        99.99
SET      30.000        99.99
SET      53.000        99.99
SET     170.000       100.00
---
---