experiments/throughput_for_writes/logs/20181112161839/ratio1:0_run2_vclients16_workerthreads64_client1_instance2.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  70 secs]  0 threads:      174254 ops,    2709 (avg:    2489) ops/sec, 10.68MB/sec (avg: 9.81MB/sec),  5.91 (avg:  6.42) msec latency

1         Threads
16        Connections per thread
70        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec 
------------------------------------------------------------------------
Sets        2454.17          ---          ---      6.42400      9905.10 
Gets           0.00         0.00         0.00      0.00000         0.00 
Waits          0.00          ---          ---      0.00000          --- 
Totals      2454.17         0.00         0.00      6.42400      9905.10 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.580         0.00
SET       0.620         0.00
SET       0.630         0.00
SET       0.660         0.00
SET       0.670         0.01
SET       0.680         0.01
SET       0.690         0.01
SET       0.700         0.01
SET       0.710         0.01
SET       0.720         0.01
SET       0.730         0.02
SET       0.740         0.02
SET       0.750         0.02
SET       0.760         0.03
SET       0.770         0.03
SET       0.780         0.04
SET       0.790         0.04
SET       0.800         0.05
SET       0.810         0.06
SET       0.820         0.07
SET       0.830         0.08
SET       0.840         0.08
SET       0.850         0.10
SET       0.860         0.11
SET       0.870         0.12
SET       0.880         0.14
SET       0.890         0.15
SET       0.900         0.17
SET       0.910         0.18
SET       0.920         0.20
SET       0.930         0.22
SET       0.940         0.24
SET       0.950         0.26
SET       0.960         0.28
SET       0.970         0.31
SET       0.980         0.34
SET       0.990         0.36
SET       1.000         0.54
SET       1.100         0.95
SET       1.200         1.49
SET       1.300         2.21
SET       1.400         3.05
SET       1.500         4.00
SET       1.600         5.01
SET       1.700         6.07
SET       1.800         7.11
SET       1.900         8.17
SET       2.000         9.25
SET       2.100        10.33
SET       2.200        11.37
SET       2.300        12.35
SET       2.400        13.37
SET       2.500        14.36
SET       2.600        15.34
SET       2.700        16.26
SET       2.800        17.16
SET       2.900        18.00
SET       3.000        18.86
SET       3.100        19.68
SET       3.200        20.47
SET       3.300        21.27
SET       3.400        22.09
SET       3.500        22.90
SET       3.600        23.71
SET       3.700        24.51
SET       3.800        25.39
SET       3.900        26.20
SET       4.000        27.03
SET       4.100        27.89
SET       4.200        28.77
SET       4.300        29.68
SET       4.400        30.63
SET       4.500        31.55
SET       4.600        32.53
SET       4.700        33.48
SET       4.800        34.44
SET       4.900        35.50
SET       5.000        36.51
SET       5.100        37.52
SET       5.200        38.52
SET       5.300        39.57
SET       5.400        40.68
SET       5.500        41.76
SET       5.600        42.91
SET       5.700        44.03
SET       5.800        45.16
SET       5.900        46.28
SET       6.000        47.53
SET       6.100        48.75
SET       6.200        49.94
SET       6.300        51.20
SET       6.400        52.38
SET       6.500        53.60
SET       6.600        54.77
SET       6.700        55.95
SET       6.800        57.13
SET       6.900        58.30
SET       7.000        59.46
SET       7.100        60.63
SET       7.200        61.72
SET       7.300        62.88
SET       7.400        64.04
SET       7.500        65.15
SET       7.600        66.28
SET       7.700        67.41
SET       7.800        68.54
SET       7.900        69.62
SET       8.000        70.67
SET       8.100        71.71
SET       8.200        72.72
SET       8.300        73.69
SET       8.400        74.63
SET       8.500        75.60
SET       8.600        76.56
SET       8.700        77.54
SET       8.800        78.47
SET       8.900        79.42
SET       9.000        80.36
SET       9.100        81.35
SET       9.200        82.31
SET       9.300        83.27
SET       9.400        84.23
SET       9.500        85.15
SET       9.600        86.05
SET       9.700        86.90
SET       9.800        87.72
SET       9.900        88.44
SET      10.000        91.30
SET      11.000        94.08
SET      12.000        96.04
SET      13.000        97.45
SET      14.000        98.32
SET      15.000        98.80
SET      16.000        99.15
SET      17.000        99.37
SET      18.000        99.49
SET      19.000        99.59
SET      20.000        99.65
SET      21.000        99.69
SET      22.000        99.71
SET      23.000        99.73
SET      24.000        99.75
SET      25.000        99.76
SET      26.000        99.78
SET      27.000        99.79
SET      28.000        99.80
SET      29.000        99.81
SET      30.000        99.82
SET      31.000        99.83
SET      32.000        99.85
SET      33.000        99.86
SET      34.000        99.87
SET      35.000        99.90
SET      36.000        99.91
SET      37.000        99.92
SET      38.000        99.93
SET      39.000        99.94
SET      40.000        99.95
SET      41.000        99.96
SET      42.000        99.96
SET      43.000        99.97
SET      44.000        99.97
SET      45.000        99.97
SET      46.000        99.98
SET      47.000        99.98
SET      48.000        99.98
SET      49.000        99.99
SET      50.000        99.99
SET      51.000        99.99
SET      54.000        99.99
SET      55.000        99.99
SET      64.000        99.99
SET      69.000        99.99
SET     180.000        99.99
SET     190.000        99.99
SET     240.000       100.00
SET     250.000       100.00
SET     260.000       100.00
---
---